Домашняя_бухгалтерия.РасчетЗарплаты/src/Documents/РЗ_ПланыЗанятий/РЗ_ПланыЗанятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РЗ_ПланыЗанятий</name>
  <registerRecords>InformationRegister.РЗ_ПланыЗанятий</registerRecords>
  <attributes>
    <name>УченикГруппа</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПланЗанятий</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Домашняя_бухгалтерия.РасчетЗарплаты/src/InformationRegisters/РЗ_ПланыЗанятий/РЗ_ПланыЗанятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РЗ_ПланыЗанятий</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>УченикГруппа</name>
    <type>
      <types>CatalogRef.Контакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗанятия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Домашняя_бухгалтерия.РасчетЗарплаты/src/Documents/РЗ_ПланыЗанятий/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РЗ_ПланыЗанятий
	Движения.РЗ_ПланыЗанятий.Записывать = Истина;
	Для Каждого ТекСтрокаПланЗанятий Из ПланЗанятий Цикл
		Движение = Движения.РЗ_ПланыЗанятий.Добавить();
		Движение.Период = ДатаНачала;
		Движение.УченикГруппа = УченикГруппа;
		Движение.ДатаЗанятия = ТекСтрокаПланЗанятий.Дата;
		Движение.КоличествоЧасов = ТекСтрокаПланЗанятий.КоличествоЧасов;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецЕсли
